{"ucla": ["I'm reading the Ancient Greece book and the first chapter was so intriguing but then I got to chapter two and now im bored out of my mind. What are your thoughts?", "bad of good experiences ?", "Hii!! I’m a junior transfer to UCLA and was curious if other transfers feel just...  left out. It’s hard to fit in because everyone is so young D: Does anyone else feel this way?? I haven’t met allot of transfers honestly and I’m always around sophomores", "Alright so like I'm trying to pirate movies but the internet on the Hill is garbage. What wifi network do you guys use?", "!!!!", "I’m missing my cat very much right now. Anyone have any tips on where to find Powell cat? I saw him during orientation, but I’m not entirely sure where I was at the time.", "so I’ve been in college for a good week, and I can already confirm that I am terrified out of my mind. I don’t feel like I belong, it’s hard to meet new people, and I’m just feeling this general sense of hopelessness. I really, really want UCLA to feel like home, but it’s so hard to feel like you’re at home with barely anyone to anchor you down. It’s a huge school, so it’s so easy to feel alone, especially with a mostly introverted personality such as mine. I don’t connect with the people on my dorm floor, and I’m wondering if my favorite roommate (shh) is just hanging out with me because she has to. I really want some advice about how to push through all of this. UCLA was supposed to be my fresh new start, but it’s pretty rocky right now. I’m desperate for a little bit of hope. thanks a bunch", "does dykstra have a laundry place and if so where?", "I’m a senior in high school (not in California). I want to major in music & move to California and hopefully get into UCLA. Anyone else out of state worried that they wouldn’t make it?"], "ucsd": ["anyone know who the professors for the 2 staff lectures for 20D are?", "There’s an art piece a bit south of Revelle called the wind garden that consists of a bunch of speakers mounted on trees, playing ambient sound. It seems to no longer be playing any sound, would anyone on here know anything about this?", "So I did the waiver thing for the health insurance the day before the deadline (which was Sep. 20th, so I submitted the waiver the 19th) and then I got an email a few days later (received it on the 25th) saying I need additional information, i.e. a letter of coverage. In the email they said to follow these instructions:\n\n&#x200B;\n\n>1. The online Health Fee Waiver application is only available through [TritonLink](http://email.ahpcare.com/f/a/6Kem0bhUGfBIb7oLEJocxw~~/AABPAAA~/RgRfbLkQP0QvaHR0cDovL3d3dy51Y3NkLmVkdS9jdXJyZW50LXN0dWRlbnRzL2luZGV4Lmh0bWxXA3NwY0IKAACQhYtdSnC06FIRZW5vZ2FsZXNAdWNzZC5lZHVYBAAAAAA~) during scheduled waiver periods.   \n>  \n>2. Select \"TritonLinkTools\", then under FinancialTools, select \"Health Fee Waiver\".  \n>  \n>3. The \"Health Fee Waiver\" link will take you to your SSO, where you will log in.  \n>  \n>4. You will then be directed to the Health Fee Waiver questionnaire on the AHP website.  \n>  \n>5. Complete the insurance information and sub'mit your Health Fee Waiver request.\n\n&#x200B;\n\nBut every time I try to do submit this additional information / letter of coverage I find myself at the \"Apply for a Waiver\" page, which only has the \"Submit Waiver\" button at the button. And this button is itself locked since the late deadline for submitting a waiver request was Sep 27th.  On top of that, I could only receive the letter of coverage yesterday.\n\nSorry if this is all too convoluted or doesn't make sense, I've been trying to concentrate and make this post legible and whatnot but it's really difficult with my family making a *lot* of noise at the moment. \n\nNow my question is, I don't know where else to submit my additional information besides this website?? Where can I upload this additional information. Any help would be greatly appreciated, thank you.", "Also do u have to sign up at the front desk or something?", "Is it a great place to get a haircut for guys or is it better to find a barber in La Jolla?", "I am a first year student majoring on statistics and probability. I want to find a summer internship on actuarial job but the problem is that I do not have a college GPA right now. I have passed exam P and plan to take FM in December. I have a little bit experience about the Excel VBA. So, what I need to prepare for the Career fair, any suggestions?", "&#x200B;\n\n**Hey everyone! I am currently looking for members to join my team for a** **startup relating to a health beverage. I am looking for motivated, ambitious and hard working people ready to give 100%/ . Looking for a group of individuals who specialize in business/marketing, graphic design and nutrition.**\n\n**A little background about me : I am a senior at San Diego State currently studying nutrition and I am super passionate about this startup!**\n\n**If you are interested, don’t hesitate to contact me directly at :**\n\n**raneemalzaben@outlook.com**", "Is it ok that my CSE 20 and CSE 12 discussions overlap? Taking 12 with Gary and CSE 20 Minnes. Not sure what to do any suggestions help", "How does one get invited to the Latinx frat parties? Do I have to be in a sorority or??", "I’m attending the career fair on Oct 2 and I’m so nervous! I’m a first-year chemical engineering major right now but I’ll most likely switch to Math-CS by the end of this year. I want a summer internship in CS but I feel like it will be weird to ask for a CS internship if I’m a chem eng major. Will anyone care?\n\nAlso, I have NOTHING to put on my resume. Should I just put the volunteering/clubs that I did in high school since I’ve never had a job/real industry experience?\n\nHow likely is it that I will get an internship post of this? I heard that a lot of companies only want upperclassmen but idk if this is true.\n\nAlso, I’m really socially awkward so how can I look more confident even if I’m not?"], "berkeley": ["please turn down the music she's asleep thanks", "Hi, I'm a sophomore intended Math major and I think I'm going to fail one of my math classes. I'm currently taking Math 55 and 54 and I find 55 very hard to understand. I know there's a study group in the SLC but it doesn't work with my schedule. I'm scared that I won't pass my class and therefore not be able to declare; my plan was to p/np and retake it next semester or during the summer. Will it affect me being able to declare? Any advice you guys can offer? Has something similar happened to ya'll before/", "Hi,\n\nI'm setting up a SFW truth or dare with some faculty/professors on campus and some students. Are there any cool questions/dares that come to mind to ask the professors? We're aiming to have a chill atmosphere so I'm looking for some not-so-serious questions. Thank!", "I have a midterm coming up, and there are ton of readings I haven't read. Do you actually need to do the readings or are attending the lectures and looking over the lecture slides enough to get an A.", "Hi, I'm an engineering student who just arrived at UC Berkeley. So I feel like I'm not being time-efficient when doing homework. \n\nFor example, if the homework is assigned on Tuesday, I try to read the textbook chapters and take notes. Maybe this takes a day. But I'm trying to balance all of my classes too, so I usually start the homework a few days before its due. I sometimes cannot find the time to talk to GSIs or professors in their office hours, and I want to change this. At the same time, I don't want to be doing the homework only to solve it. I feel like even though reading the textbook takes a long time, it helps me understand things on a more conceptual level instead of doing the homework without a clue. \n\nIn addition, I'm only taking 13 units, and I feel like there are students here who are taking so many more units than me, are able to do the homework faster, and do extra activities like clubs. I'm just amazed at how people can do this. I feel the only thing I do in life is always studying or walking to my class or eating, and I still can't manage my time.\n\nWhat strategies do you do to get homework out of the way once it is assigned, and at the same time learn the content? Also, do you study with friends or by yourself? Any tips on surviving the homework and managing time? lol", "What does the grade distribution usually look like for the midterms? Also, does anyone know how the class is curved in the end (i.e. how well one needs to do if aiming for an A/A-)?", "I was just wondering if any sociology major were transfers, and if so what did your admitted GPAs look like prior to enrollment as well as extracurriculars? Just looking at my odds lol.", "Hi! I really need help preparing for my math 1A exam next week. If anyone is willing to tutor me/ knows a tutor, that would be greatly appreciated! If any of you guys want to start up a study group send me a message! Any other resources you know of that might be helpful for studying, let me know! Thanks !", "Me and my friend aren't able to go tonight and would love to sell them. They are General Admission tickets bought at ~$93/ticket, so I think selling for $58/ticket is reasonable :) thanks!"], "gatech": ["We have been on campus for some time now... and uh we still have not been on dates. I know it is somewhat our fault because we don't really approach guys (we're girls btw), and the solution would be to approach guys, but we just aren't comfortable with that yet. So, we were wondering if you're a guy on campus, do you feel comfortable getting to know a girl and approaching her first in the right environment and situation. Do you guys have any tips on how to better our dateless situation. Thanks!", "I got ran away from home because my dad got way out of hand again and started going off and need help and a place to stay. When the officers came to my house they said it was best for me to be away from home. Long story short, I took some clothes and all my schoolwork and left home. Once my marta pass ends on October 1st I gotta stay somewhere near campus cause I can’t afford to be anywhere else. I don’t know who to talk to and if they can even help me find emergency housing or if they can consider me homeless. Any help/advice is appreciated. Thanks for your time.", "We are losing to Temple.\n \nWe have 2 points.\n\nThis is embarrassing"], "MIT": ["Anyone here that has studied the course 10.626 / 10.426 and has the p-sets and the exams of any previous year with solutions for both?", "I really like the study space on 5th floor. Is it still open in midnight?", "Hey folks so this would be my 2nd time attending MIT for the global community biotechnology summit from 10-13th. I'm arriving in the 8th as I was selected for their fellowship program. \n\nI'm looking for new things/spaces and maybe even labs to explore whilst I'm around. I'm coming from the UK, but living in Copenhagen. My background is material science and community biotechnology with a focus on ethics . \n\nI had several small lab tours last year and a few off campus tour too in my own time. But I'd love insight for this year. \n\nThanks \nNel", "About a year ago I came across an MIT Moviegraph at a garage sale for 5 bucks. I was able to track down the last person to have it as this guy  [https://www.worthpoint.com/worthopedia/mit-vintage-moviegraph-projector-752-501169322](https://www.worthpoint.com/worthopedia/mit-vintage-moviegraph-projector-752-501169322)  who sold it on eBay. I wanna know if it's from MIT or just a random movie graph.  Please leave any info you might know in the comments.", "Hey guys, I am looking for people to play squash with! I play intermediate level squash. I am a female and I like to go there during evening! Let me know if anyone is up for some squash fun! 😍", "This is a stupid question but I was wondering if there’s a club fair or anything of the sort or if to get involved in clubs you simply email them via MIT engage or something.", "What happened to LSC?  The most recent schedule is from last year,  and searching LSC in the Tech gets me nothing.", "My team and I have been in the eCommerce game since 2014 and our goal is to make money. We're currently in the process of looking to build out a product solution for other business owners within the market that we're currently already doing business in, but we don't have the software development skills to build the product. We specialize in business development and marketing.\n\nThis product will be a separate entity to what we're already doing but the product will help us bring in more revenue and profits for one of our current businesses while the project will also bring in additional revenue for its own. We've already tried hiring many software developers to build out this product but unfortunately, they are unable to build a software solution that competes in **speed**, **accuracy** and **bypass securities** compared to other few software solutions that can out in the market. Therefore, we're looking for someone specific and someone interested in a partnership. This person should be disciplined, reliable and isn't afraid of failures as this product is hard to build so we guarantee that there will be roadblocks and failures along the journey. They will own 50% of this project and it's non-negotiable. We're looking for someone serious and a LONG-TERM partnership commitment.\n\nThis is for someone interested in making money, show off their coding skills, likes to compete with other coders or interested in bypassing security, love to learn, figure things out and making things perfect. We're very confident that there's a high chance of success in terms of generating money if the final product can be built to compete with other few software solutions that are already out in the market.\n\nPlease note that many others have tried building a similar software solution out on the market but have failed. If you like to give up easy and think that making money is easy, then I don't think this is for you. We are transparent because we don't want to waste your time so we hope that you don't waste ours.", "The info is supposed to be on the page below but it's not working for me (and I've triple-checked my certificates).\n\n[https://web-cert.mit.edu/facilities/transportation/bluebikes.html](https://web-cert.mit.edu/facilities/transportation/bluebikes.html)\n\nIf anyone knows, it'd be great if they could DM me. Thanks and happy biking!", "Hi All, I swim everyday at Z center (Best swimming pool around Boston!!). Now I need a swimcap. Where can I buy a MIT swimcap? I like to purchase one. I collect university swimcaps... Thanks"], "brownu": ["Has anyone gotten in with only one subject test? I have a 700 in USH and 800 in bio and wondering if I should submit one, both, or none. \n\nWhen I attended an info session over the summer the admissions officer said that if you submit one subject test they expect to see another one... this worries me because I'd rather only submit my 800 in bio because I feel like the 700 in ush drags me down \n\nSorry to bother you guys about admissions❤️I am eternally grateful for responses to this", "What does the weather look like here each month? Like when does it start snowing and get real cold? \n\nThanks - a SoCal freshman", "Hi, international high school senior here. I'm applying ED to Brown, and on the admissions website it states\n\n\"Early Decision applicants should complete all required testing by the October test date. All Early Decision applicants should have test scores submitted prior to the November 1 deadline.\"\n\nI'm taking Physics and Math 2 on 10/5 and planning on CS or \"Science, Technology, and Social\" as my concentration.\n \nThings would have been fine but last night at 2 a.m. I learned that my test center was closed and Collegeboard would follow up with \"a makeup test at no additional charge\" yet to be announced. Originally the scores for 10/5 were expected to come out on 10/18, but now I'm pretty sure I'll end up missing the deadline.\n\nWill I be able to submit my scores after 11/1 if Collegeboard does arrange my test to be too late? And how would I go about doing that if I've already submitted my application through the Common App by then?", "I'm a first-year in Math 540 and it is the first time I've seen this much higher math nomenclature or proofs. My professor and TA have limited hours, and the tutoring center doesn't have a math 540 group yet (which I'm confused about). Is there any other place that I could look for help?", "I’m super interested in Brown, and I’m wondering if anyone has any insight on how engineering is at brown in general", "i have a big exam the week after the game... should i go to the game anyway for one day? or is it not fun and i won’t b missing out? i’m a first year btw", "There was a post here a while ago about where to practice piano on campus. I have a similar question, but about drum sets- are there any practice rooms where there is a kit free to use for students?\nThanks for any input", "I'm a high school senior in Taiwan, and Brown is definitely my top choice. But here's the thing. I intend to major in CS, but (I've heard) that this could hurt my chamces. Would you recommend I list another major on the application? And how much does the intended major I list on the application actually affect the admissions decision/school life if/when I'm accepted?\n\nMy ECs are all over the place, with very few of them actually having anything to do with CS. Quite the opposite, most of them have to do with the arts and humanities, social science, etc. (debate, minority journalism, filmmaking, etc...and only two or three CS/engineering-related achievements). On the application, I actually listed the \"Science, Technology, and Social\" as my second choice concentration, after CS.\n\nMy biggest problem is, I've never really thought about this. CS is an interest, yes, but I'm mostly considering majoring in CS because I have no other clear direction to pursue. That's also part of why I want Brown, because I thought I'd get to really make an informed decision afterwards.\n\nTL; DR: would not selecting CS on the application boost my chances of getting in, and how would doing so affect me if/when/after I get in?", "Hello! I'm a HS senior interested in applying to Brown ED. I will be visiting Brown on 10/6-10/7 and I would really love the opportunity if I could meet with a current student and talk about what it's like to be a student at Brown and get to know the campus more. For reference, I am planning on concentrating in Biomedical Engineering and applying for PLME. I really like physics and medicine.", "Hi, freshman here, I was overwhelmed with everything going on the first weeks with orientation and the transition and I feel like I missed all the club info sessions, applications, etc. Does anyone have suggestions for clubs it's not too late to get in on now or even in a couple of weeks from now? Do clubs usually open up again for new members next semester? I know there are so many clubs and it will depend but I'm looking mainly for something fun I could do to make friends"], "cmu": ["Plz let me know if people actually hook up. Also how tf are people dating here. I’ve been here for a few years now and wtf is happening I’m sorta single.", "I'm a current freshman planning on majoring in economics. I have absolutely no background in cs, but I would like to take a couple of introduction cs classes. I want to start next semester, so should I take 112 or 110? The rest of my spring semester right now looks like multivariate analysis, global histories, principles of macro, and reasoning with data. Thanks!", "First time doing a job interview. How formal should I be/wear? Should I be practicing answers or is this is mostly a formality? Kinda nervous so thanks", "Hi all, I am looking to develop a concentration in Computer Vision. I am interested in both software and hardware aspects. I was wondering what are some courses which deal a little more with hardware, courses which go over LiDARS, RADAR et cetera. \n\nAlso, I am aware that there are a plethora of CV courses available at CMU, but I would like to know what are some essential 'MUST' have courses. Currently I have taken 16-720 and am planning to take Visual Learning and Recognition, and Physics Based Vision. I know VLR is a course that most CV people take, but does anyone have any reviews of Physics Based Vision?   \n\n\nRelevant courses from other departments are also welcome", "Is there a way to check your bandwidth usage? The one on the CMU website just doesn’t list any devices on my account for some reason."], "princeton": ["I noticed that pedestrians in Princeton don't particularly negotiate with the several-ton vehicles that are about to flatten them.", "Hey!\n\nI'll be applying to Princeton next year., had some questions so please reply here or PM me.\n\n* How flexible is the university when it comes to designing your own major and pursuing an independent study program?\n* I want to do a dual degree in two from physics, mechanical engineering, and CS, how good is Princeton (in both absolute and relative) terms for a person looking for a career in tech and/or programming.\n* What's the student culture like? How many nerds do you find? Are dorms nice? Are there any safety issues in/around the campus? \n* Does the university have intensive, pure CS, physics, and mechanical engineering programs?\n\nRegards,  \nMJ", "I'm a new grad student here interested in meeting people to hike, paddle, sail, fly fish, etc with. What kind of clubs are there?", "Hi,\nAs I will be working in Princeton for half a year I need to drive a rental car. Is it possible to do that with a foreign license from Germany?\nOr do I need to get a new license?\n\nThanks for any tips!", "Hey I'm a senior who's trying to decide between on a restrictive early action school. Always loved Princeton's environment and culture! However, I'm not sure if I should apply early because I'm trying to decide between Econ and BioTech and I haven't heard much about Princeton's biotech/biology program....\n\nAny insights?", "Im applying to some programs and I fell in love with the campus and the staff is all so friendly. I’ve been dreaming about going there since I was in high school and how many students get accepted into the Spanish and Portugal program (roughly)?", "Pretty much the title. I visited this summer and absolutely loved the campus and Princeton has always been a huge dream of mine. But I’ve always wanted to know something that google doesn’t really help with, and that’s personal experiences. What’s the culture like in the student body? Is it academically focused and competitive? Or social and friendly and inviting? Thanks for the help!", "I'm currently a senior in high school about to apply to college this fall, and I've been warned to consider the stress culture at the colleges I'm applying to. For example, I know that University of Pennsylvania is considered very cutthroat and competitive between students, making for a more stressful student culture, while schools like Brown University are comparatively laid back and less competitive. I definitely expect the workload and class material of any top school to be rigorous, but some schools seem to host a more stressful environment than others. I don't think I'd like attending a college that is overly competitive and stressful.\n\nI was wondering if you all had any advice for me regarding the stress culture of Princeton? My dad attended Princeton years ago, and he says that students are serious but pretty supportive of each other. I'm sure the school has changed since he graduated, so I would like to know your opinions. Thank you!", "Pretty much the title. I am interested in applying to Princeton, but I do not know what the culture is like there. Is it extremely competitive or is there more of an environment of kinship? How many hours a day does one need to dedicate to his studies? If it is stressful, does it go sofar as people committing suicide?"], "harvard": ["Me and a couple of friends have been going to Berklee for a couple years and the party scene there really isn't anything special, so we were going to try to branch out and meet people at Harvard. Any good bars or places to look for parties? I know this is probably a long shot but it never hurts to ask.", "Everything feels so bleak sometimes. I'm so scared and there's so much potential for so much to go wrong and I'm so fucking terrified of it all that I don't even want to try to get it right. I guess I'm a coward. This isn't even Harvard's fault. I know this is mental illness, but I don't want to get better. I just want to die.\n\nThis isn't a suicide note. There's no need to worry.", "I’m currently a student at Boston University studying Economics with special emphasis on Microeconomic theory, quantitative methods, and econometrics.\n\nI want to try and find a job directly after undergrad but I also want to be able to continue my education (likely a masters in data science to improve my statistical literacy and learn to apply it to Econometrics) so Harvard Extension seems like a good idea given its flexibility.\n\nIs it frowned upon for a traditional student to attend Harvard Extension with no gaps in their education? I really just want to be able to work while obtaining a Harvard-education. \n\nAny feedback (esp. from HES alum/current students) is appreciated.", "I hope this doesn't come off as spoiled or entitled, but I've found the hours of the dining halls mildly frustrating, as they don't serve food after 7:30 PM or between 2-5 PM.\n\nAsking purely out of curiosity, why do the dhalls close between breakfast, lunch, and dinner? Is this common at colleges?\n\nIt's really not a big deal, but I was wondering what the rationale was behind that.", "Do you say you go to harvard on tinder or bumble or other dating apps? Some of my friends (girls) say it’s a negative while a lot of guys do it all the time. One guy told me he gets matches that way", "Who exactly is eligible to write fellowship rec letters? Is it only professors, or can TFs, resident deans, tutors, research advisors, etc write one as well?", "Doing some research on what the club life scene is like at Harvard! Hope some of you guys can help me out :)", "Hello, I am a sophomore college and I am looking into Harvard for Law School to study Human Rights Law. Do students try to sabotage other students? I don’t mind pushing myself to the limit but I just have heard lots of rumors about the competition being astronomical at Harvard.", "Hello, I have some questions to I'd like to ask.\n\nFirstly, according to this link( https://ofa.fas.harvard.edu/rehearsal-practice-space), all Harvard's students can access practice rooms in the music department. Do the students enrolled in Harvard Summer Schools get access to these practice rooms?\n\nSecondly, the link says that one room has a harpsichord. Does anyone know whether the harpsichord is a historical model or a revival harpsichord?\n\n​\n\nThank you!", "Every day I walk past the science center on Oxford Street (Annenberg to Northwest Building) and I almost always notice water droplets falling on me. I know a couple of other people have noticed, but no one has been able to explain what it’s from. Anyone else notice this and knows what its from?"], "cornell": ["Hey guys, for any of you who have taken the first Psych1101 prelim before I was wondering how easy it is? What sorts of things did he ask you about?", ":(", "What do you guys usually do to feel better", "Every day when Eun-ah Kim lectures I can't listen to a word because there's this fucking ADONIS from the ORIENT who blinds my eyes and my mind with his unparalleled beauty. I just want to entangle my wavefunction with him and tensor product our states together all day long, but I'm not sure how to express this to him.\n\nFor context, my GPA is 3.7 and I have 2 years of experience working in a theoretical condensed matter lab.", "Would you eat a professor’s ass for extra credit?  Help guys this might be the hardest choice of my life.", "Hey everyone! I’m a singer/songwriter, and I really want to start a band! I really like to play indie/alternative, and that’s mainly my style. Looking for any type of musician that would want to do this! 🎶🎤", "If anyone has an extra or knows an office that might have some, I would appreciate it.", "Apparently the first prelim is a bitch, anyone have any advice on why it's so bad?", "at one of the classrooms in GSH last week and haven’t found it. :(((( It’s black and... idk looks very cute. where could it be :((( I’ve been so tired since school started ahhhhhhhhhhh something good happens please"], "columbia": ["Is it Sunday at 2am or Saturday at 2am?", "I know that being surrounded by people is a given when going to a large university in NYC, but I’m feeling very overwhelmed recently and it would be nice to just be alone with my thoughts for a little bit. It’s like everywhere I go is crowded... even in my dorm I’m not alone since I have roommates (even though I love them...)\n\nI’m specifically asking this because I’ve been having a lot of panic attacks and it feels so embarrassing to break down in public, especially on campus when people might recognize you.... \n\nSo yeah, where do you go to decompress?", "I went to HPS yesterday because everyone deserves a damn treat after class on Thursday. After I took the first bite of their pumpkin cheesecake, I am DESTROYED. So many emotions arose with its complex flavor. The vivid memories of my childhood fall were flushing in. I saw my late grandma reunited with me and I finally feel content with my current life and my past. I have learnt so much from its wealth of flavor, even more than most of the tenured professors in Columbia. \n\nI’m totally shook. It’s out of the world guys. Try it and share this ride of emotional roller coaster with me. It’s a trip and I’m so here for it. Pumpkin cheesecake is the new LSD.", "I need a place to store my stuff for just a day, anyone know of available lockers for graduate students?", "I heard your rant about gay marriage by the low fountain. I agree man gays are awesome I love gay marriage ♥️😌", "Hey Everyone!\n\n can give me insight on the top 3 big events or moments at Columbia. Any events, concerts, organizations put on throughout the year?", "I was curious about it, but was too worn out at that moment to ask.", "Hey guys,\n\nAs an international student on an F1 visa, I recognize how hard it can be to find a job. I wrote a [blog post](http://shikharsachdev.com/how-to-get-a-job-as-an-international-student-in-the-usa/) outlining my own experience job hunting and shared some advice.\n\nLet me know if you find it useful or have any questions!\n\n[Here's a link to the article](http://shikharsachdev.com/how-to-get-a-job-as-an-international-student-in-the-usa/)", "Is there a chess club at campus that meets regularly?"], "dartmouth": ["Personally, mine involved a slice of deli turkey, lucky charms mixed with cheerios, and pesto spaghetti.", "Hi everyone! I'm working on a startup to help make parties and bars a little safer. If you would be willing to take a super quick survey, I would be *so grateful* and it would help me out so much!! The link can be found [here](https://cuboulder.qualtrics.com/jfe/form/SV_bNS7MYocNSkFmgB). Thank you so much!!", "hello. i am bad at science. does anyone have recommendations for science/social science/technology classes fit for an english major?\n\nthanks guys", "hi! i was wondering if i could get opinions on two options for study abroad. my options for the spanish LSA are buenos aires and barcelona. i'd love to hear from a student who went on one of these or has any idea which one of the two would be a better experience. thanks so much!", "I know there are many asians, but how prominent are they in the school community?", "Hi. I would be starting grad school at Dartmouth in the winter term and I’m wondering what the housing price range is for on-campus housing. Also, is there a way to connect with other grad students to find people interested in renting a place together. I’m trying to make sure I don’t spend all of my stipend on housing.", "Hey all,\n\nI'm a 1 year graduate student and currently live in a 4 bedroom 2 bathroom North Park apartment. I am sharing my bathroom with another 1st year graduate student and he leaves the bathroom in unacceptable conditions for a common use area. I talked to him twice about this already but no action taken.\n\nThe very same guy uses the common kitchen for 4 of us in the same way too. I noticed that everytime after he used the kitchen, there are always crumbles/jam drops/grease on the counter. Now there is greasy pasta pieces on the kitchen ground. \n\nAs you might have noticed already, the guy doesn't care about hygiene procedures at all. Actually I don't mind this that much whenever he keeps his room's door open we have a heavy odor in the rest of the apartment.\n\nI'm already on my nerves, and other 2 guys are very respectful of the environment around them. This guy persists being a needy adult and harms the other roommates. I talked to our residential fellow about this behavior recently and I believe this might alleviate the issue a little bit I'd be very happy if you can enlighten me about the procedures to follow if that fails.\n\nI believe he has a wealthy family or someone who does the cleaning for himself at his home as his dad visited once and he mentioned he was considering to hire a cleaner to come into our apartment once in a while. I believe at this point of life he should be able to clean after himself and maintain a respectful common area for all.\n\nFor those who might be discriminating, the guy mentioned is from New York; so not from another culture.", "Like I know local sororities can serve alcohol. Do they throw parties? Are they open to non affiliated people and 23s? Do the coed greek houses also throw parties? I just feel uncomfortable in normal frat parties"], "bostonU": ["Those who’ve taken comp org w/ kinsy, how hard is the first midterm? How hard are the risc-v questions(assuming he’ll test on it since we barely started the unit)", "When do we have move for winter ?", "for level 3 and 4 please!", "Ok so I've been confused about this for approximately a year: do people fill a bowl up with Goldfish and just sit down and chow in the dining hall? Or do they, like, sneak a bunch of these lil fishies out in their pockets? The former just seems... odd. This is urgent please help", "I have to take 12 credits of electives (anything level 500+) in any college, looking for recommendations", "I have 2 midterm exams in one day.\n\nIs this a plausible excuse to talk to the professor and rearrange it?\n\nHelp!", "Is it true chem 101 is harder ? Despite chem 109 which is supposed to be advanced .", "So us CGS kids just received an email containing the directions for course selection, so I guess that means it’s time for us to start thinking about it. \n\nI’m not familiar with any of this, but I’d like to know if there’s an “ideal” course lineup that most people choose in their semesters at CGS.", "REPLY WITH YOUR RECOMMENDATIONS FOR A LIGHT-WORK HI, EN, or WR class PLEASE!\n— I’m about to be a senior and I don’t want to be stressed out in an class that’s not related to my major !! THANKS Y’ALL ❤️"], "ASU": ["So I am planning to move to Tempe next semester, as living on Poly isn't doing enough for me socially. I'm looking for some honest opinions on off-campus housing, as reviews on other websites seem to be inconsistent. If I have to live in Vista, I will, but I'd rather find something that's not $950/month first.", "For people who have taken CSE360, would studying the powerpoint slides be enough for the test, or do I have to read the textbook too? I have another test that day, so I would like to be able to focus on that class too.", "I'm considering adding a minor in Sociology. Are there any upper division sociology classes that are particularly interesting or have great professors teaching them? \n\nThanks in advance!", "I used to be able to remote into the computers but it looks like they changed the procedure or something because it doesn't work anymore", "I want to join a fraternity in the spring but I’m not sure how the spring rush differs from the fall rush. Do all of the fraternities participate in spring rush? And where do they do recruitment during spring rush?", "Thanks!", "I love seeing ASU football with Herm Edwards at the helm. His brand of football is really entertaining, and your true freshman qb looks like hes going to grow into a hell of a qb over the next few years.  Love watching your games, my favorite Pac12 south team.", "Hi everyone, \n\nI’m a junior that is considering applying for the 4+1 for biological sciences. The PI of a lab I want to ask to be my advisor doesn’t like the 4+1. He thinks it’s sort of cheating the system in a way and that the experience isn’t as immersive as it should be. I have enough credits to graduate next summer, so a year early, and then I could start a regular masters program then, but would that be covered under my New American University Scholar Presidents Award? The award is for 8 terms, and given that my bachelor’s will only take 6, it should be covered, right? (Edit: I realize that for the NAUSPA, I need to take 30 credits a year, but a masters degree is 30 credits for two years, so I don’t know if it will work) \n\nMy other option is to take a minor to increase my credit count to allow me to do the 4+1 (without the minor, I don’t have enough semesters left to qualify for the program). This way I could get my bachelor’s, a minor, and a master’s done at the same time. \n\nEither way, I’ll be done with my master’s in 5 years, I just don’t know if I should do it by graduating early and starting a master’s program early, or if I should get a minor, do the 4+1, and do it that way. What do you guys think?"], "caltech": ["Hey I'm a master's student in aerospace engineering, at Virginia tech. I was planning to do my PhD at Caltech. But looking up online, I didn't find many people who had gone there solely for a PhD. It's mostly a grad program which consists on a year of master's followed by a PhD. My question is, is there no standalone PhD program at GALCIT specifically, for someone to do after masters from someplace else?", "Im currently a senior about to submit my application for ME but I have seen so many people winning google science fair awards, siemens research papers, MIT THINK and many others that I am feeling pretty underprepared. I have spend all my life until 11th grade in India where i couldnt get any internships, research papers, science fairs etc. Even our school didnt let us do practical stuff in engineering. But i made what best i could from what i had at the time. I have national level music prizes, tutoring, countless state level technology, space, computer prizes and i have made some tiny things like portable chargers for a phone, experiments in many areas of physics but nothing at the level people do in USA.", "Hello! I am currently an aerospace engineering major going into my second year of university (Not at Caltech). I have had my eyes on Caltech as a graduate school that I would like to attend possibly in the future. Specifically, I want to apply to either the Aeronautics or Space Engineering degree program under GALCIT. Can anyone shed some light on what it takes to get into the program?\n\nAny information would be greatly appreciated!", "Are all the laundry rooms in the tunnels under the houses or are there laundry rooms above ground too? Also, are they often all in use, especially on weekends? How often do people usually wash their clothes at Caltech/ will it be a huge hassle to get laundry done with the amount of machines? Thank you", "Are there any pest issues at Caltech or in any of the houses in particular? I’m terrified of insects so is there anything I can do to minimize chances of seeing them in living spaces/dorm room? Also, I know that I shouldn’t pick a house based off of this but I have to ask: is there any house that typically has the least bugs? Thanks!", "Hi! I am a high school senior and Caltech has been my top choice school for a long time. I can foresee the \"Focus on getting in first\" comments, but I have already been accepted to the competitive Caltech Up Close fly in, which has historically been a strong predictor of acceptance to Caltech. Although I know that nothing is set in stone, I'm acting on the assumption that I'll be heading there next year. Since I got into the fly in, I've been thinking a lot about how life will be as a student there and what I can do to prepare myself for it. I have no delusions of being the \"best\" at a school with such outstanding talent, but I feel as though I am inadequately prepared to achieve my goal of a 3.7+ gpa there. I'm planning to major in mechanical engineering. I'm currently taking dual enrolled multivariable calculus, and will have finished all levels of AP Physics when I graduate, but I have never pursued competing in the AMC/AIME or USAPhO competitions, and having looked at a few math 1a problem sets, will likely suffer for it, as they are almost entirely proof based. This is why I am trying to start preparing as soon as possible. Is there a textbook I should look at? Is studying for AMC/Physics Olympiad a good use of time? What about emotional preparation? Any input much appreciated, thank you.", "Hello!\n\nI will be joining Caltech as a \"Visiting Student Researcher\" from September 15 to Mid December 2019.\nI am looking for a room to rent, sublet or share for this period. Any help or pointers in this regard would be truly appreciated.\n\nps. I have my Caltech UID and if there are any housing related Caltech mailing lists I can be added to that would be great.\n\nThank you."], "uiuc": ["I know there are some at CRCE and at the ARC, but how can I join them. Also are there any RSO’s dedicated to yoga?", "Edit: More like \"without\"", "this is a quick survey (takes around 3 minutes) about lap desks and is for my industrial design (junior) class. we'd really appreciate responses! if you have any questions please feel free to let me know. Thank you very much!!\n\nLINK: https://forms.gle/zsjM9GPsK3pwrrbD8", "is it weird if i decide to dorm in daniels if i'm a undergrad sophomore?", "Soooo..\nThe “annual UIUC sickness” I thought I had is looking a lot more like strep. Anyone know if McKinley supplies antibiotics for that?\nThank you 😬", "So I don’t have a lot of friends here, and the ones I do either don’t wanna go out to parties or bars, or can’t because of homework or something. I’m not in a fraternity/sorority so I don’t have connections to parties or events really. I honestly just want to be able to go out and have fun, but have no one to do it with. My roommates seem to be into going out, but they have friends and their Greek sisters/brothers so I feel awkward asking or trying to join them. \n\nAm I screwed or is there something I can do?", "This class is so beginner “friendly” that I want to drop out of college just thinking about it."], "uchicago": ["Just got a vintage watch and it looks like it has radium paint on the numbers but I want to make sure. I would buy a Geiger counter but there’s no way to know if it actually works. I know research labs have to test their Geiger counters regularly. I just want to see if it is radioactive so I can send it to a guy that removes the radium paint. I know it’s not that dangerous anyway but I would prefer to check it. Thank you for any help anyone can provide!", "Does vue get the uchicago secure network? If not is there another network for vue, or do we just get our own?", "Hello, \n\nI am applying for a job at U of C, and I'm wondering if someone could get me the \"Reading Cultures: Collection, Travel, Exchange I-II-III\" syllabus? Thank you in advance! :)", "I’m not sure if those who aren’t actual students at UChicago can make threads here, but here I’ll go anyways. If anyone knows Georgia or Colby that gives info sessions/tours (or if they’re on here themselves), PLEASE send this message on to them. They did an amazing job and really made me fall in love with the school. Both were brilliant at their jobs and if I do end up going here, it will be majorly thanks to them. \n\nP.S. My name was Ryan if they remember me at all (they probably don’t but lol). I did the Sept 26 tour and was wearing a navy blue American Eagle shirt.", "For the math major, there's a requirement to take 2 classes out of the \"list of approved courses\" with a ton of elective/topics classes. For anyone who's taken some of these courses before, which were particularly well-taught/interesting? I'm considering take quite a few of these to increase my mathematical breadth and stumble upon some new facets of maths that I may really enjoy.", "Divvy is too far from my dorm. Prefer buying over renting.", "I’m not trying to smoke in my room but if I heat up food and it gives off steam or if anything else gives off small amounts of steam/vapor/smoke, will the detector go off?", "As the title says, I was using some of those little adhesive hook things, but one of them fell off the wall and took some of the wall paint with it. Will I have to pay for the damage, and if I do, how much will it be? Alternatively, could I just buy some white paint and paint over them?", "Also, would CMSC 121/122 be better for a beginner?", "Does anyone know what goes on in the medical clearance for student athletes? And how long it take? What are some reasons to \"disqualify\" someone?"], "chapmanuniversity": ["Liberal minded Presbyterian church in the City of Orange (walking distance from Chapman) has an awesome traditional choir but would love to see if anyone is interested in signing with us. Loving to sing is all that matters, you can learn the rest as there are all varying skill levels! DM for more info. :)", "In this case a CA Community College", "I am coming from out of state in a couple weeks for my daughter to take a campus tour. I know it's summertime so the \"vibe\" won't be the same but was hoping for recommendations on where we should eat lunch so that she can get more of an experience of what Chapman would be like.  Any suggestions would be appreciated. Thank you.", "I'm transferring to Chapman in the fall and am looking for a place to live off-campus. I work part-time managing at a pizza place and like to build computers, cook, and watch sports. I keep my room pretty clean and respect my area of living. My credit is good and my parents will co-sign on any agreement. \n\nAlternatively, what other resources should I try to use that other students like me have success with?", "When do we learn our freshman roommates? They said mid July but it’s getting kinda late?", "I know we're a small school, but I'm in need of Chapman-specific memes, and there doesn't seem to be any here..", "Hello Panthers, \n\nI am an incoming high school senior in Riverside County, CA. In college, I plan on studying psychology and leadership or maybe business management/administration mainly. This fall I am planning on applying to Chapman, but before I do so I would like to know what you all believe to be the pros and cons of Chapman. \n\nThank you!", "Hey Chapman students and Alum! I work with homeless people in Orange County and one woman I work with named Cathy was featured in a student film about 8-10 years ago. She was running a ministry out of her RV and three students followed her around to create a 15 minute short which I believe they brought to a film festival. Cathy lost her copies of the video after years of homelessness and I was wondering if someone could help me track it down so she could have a copy again. Thank you!", "Anyone have it or know how to study for it"], "Emory": ["Hello! I am a current senior who is interesting in applying to Emory Early Decision. I am visiting campus on October 14, but unfortunately there is not school that day so I cannot visit a class and will probably not have the opportunity to talk to a current student. I was wondering if anyone of y’all were free to answer some questions that I have in person between October 12-14 as I have way to many to ask on Reddit. \n\nI know that it’s weird to meet with an Internet stranger, but I would really appreciate it and will buy you a gift card for your time.\n\nAlso, what parts of Atlanta or campus should I see during my visit?", "I’m a freshman at Georgia State, looking into transferring to Emory after my first year here at GSU, majoring in chemistry. How difficult is it to transfer into Emory after just one year at another 4 year college? Will they be taking my SAT scores into consideration if I maintain a 4.0 GPA and had high grades in my AP classes in highschool?", "Hey guys,\nIm a senior in high school and I want to go to Emory. I want to study biomedical engineering, however. \nI know that Emory itself does not offer engineering, but it has highly ranked dual enrollment programs with Georgia tech. \nI wanted to know how hard it is to get into these programs once you are already enrolled at Emory? \nAlso, If anyone is currently enrolled in one of these engineering dual enrollment programs, do you like it? Pros and cons?\nThank you!!", "Yes it’s only September, but I’m already worrying about next year’s housing. Where do juniors/seniors usually live if not Clairmont? Any suggestions? I’d be able to pay $1100/month rent MAX (for a multiple bedroom apartment shared with others), is that doable for the apartments around Emory?", "looking for a place near emory hospital", "Hi guys, I am a rising senior and considering applying ED1 to Emory. I am interested in business analytics and would be looking to combine coursework in business and data science.  My goal would be to join a consulting firm upon graduation and work on the applied side of data analytics (as opposed to programming) . Looking at the different degree options, the two dual degree programs look interesting - BBA + QSS and BBA/MSBA. Other than the difference in the additional 6 months it takes to complete BBA/MSBA and the fact that it will grant you a masters degree, what are the differences between the two dual degrees in terms of course content. Are the job prospects similar or different? Based on my interest, which would provide a better option. I know this is something that I would need to decide later down the road but an understanding of the various programs that the school has to offer is an important factor in my applying early decision to Emory. Would really appreciate any insight.", "Hello y'all! I'm a senior and Emory is my top college as of right now. I'm planning to ED there, and I'm a little confused about the way degrees work, because it says that Emory only allows 1 undergraduate degree? Because I'm want to do something like 2 majors and 1 minor, does that mean I have to enroll for 5 years (graduate program? idk I'm kinda confused)?\n\nAnother question I have is the partnership with Georgia Tech, specifically for Computer Science; how does that work?\n\nLast question: am I allowed to get a Bachelors Degree in Computer Science, but have my major as computer science yet my minor is in Korean or something completely irrelevant?\n\n&#x200B;\n\nThanks!", "I added  a class right before the end of add drop swap, that I received AP credit for. When I talked with a class mate recently, they told me that I can not take that class if I got credit or completed at Oxford (based on the professors words). So, what should I do? Do I just stay in the course and ride it out or contact my OUE advisor and drop the AP score (I am a sophomore so I don’t know if I can do this).", "Hello! \n\nI am a current senior and I am trying to decide where to ED. I love Emory but I am so conflicted and indecisive about EDIng because there is another school I like. Can you guys speak to some amazing things and some not as amazing aspects of Emory? Specifically about campus life, as I know little about it."], "harveymudd": ["I was wondering if one would be able to request a single bed dorm, rather than shared, as a freshman at HMC.", "i visited and fell in love but it’s so hard to get in to so idk what to do:((", "Does anyone remember who taught the high power rocketry class circa 2009/2010?", "What's that crazy dance song about fire that they played during frosh run and the mentor skit? It's been stuck in my head all day", "I still have to take the SAT subject tests...\n\nI am a female interested in CS and engineering. I still am unsure whether I should apply to HMC as I've heard the curriculum is very cutthroat. I just want to know whether this is the school perfect for me", "Hello! I'm an international applying to HMC and a supplement essay prompt has put me in deep confusion. The prompt says \" Tell us about your dream HSA class\", I've done some research about the available HSA classes, but my concern is: should I write this essay about some of the available HSA classes at HMC or just describe my ideal HSA class? And if its the secons option, is it ok for me to make a refference to some exisisting HSA classes?", "Just a rising senior considering HMC for ED, and want to know more about the school. What might be the benefits for a CS/Math Major interested in Entrepreneurship, Soccer, The Electric Guitar and teaching/mentoring??", "(Only those who did the IB alone and not other local curricula/APs blah blah)\n\nWhat were your IB scores that got you into HMC(Mock exams/Year 1 finals/ and predicteds)?\n\nSidenote, do you think predicteds hold greater weightage than the year 1 end exams?", "Hey guys!\n I'm applying to college this year and my counselour advised me to apply to HMC on early decision since I'm interested in computer science. However, I found online that the admission process is very xompetetive and that they don't provide much financial aid for internationals such as me, are these claims true? And also what is the average acceptable sat score?", "Hello everyone, I am a rising high school senior who is interested in applying to Mudd. From my understanding, the academics and undergraduate focus are top-notch here, but I haven't heard much about the social life/student culture. What do students typically do on weekends for fun? (I understand that not every weekend will be open for free time) I love hiking, running, kayaking, and generally anything outdoors-related, as well as exploring new restaurants/places in the city. What are some of the best and worst parts of attending Mudd? How are the dorms?"]}